//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//組み合わせシミュレーション時の同名ポケモンの判定用
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
const POKEMON_SAME_GROUP = {
            "ハピナス": "ラッキー",
            "バケッチャ(こだま)" : "バケッチャ",
            "バケッチャ(ちゅうだま)" : "バケッチャ",
            "バケッチャ(おおだま)" : "バケッチャ",
            "バケッチャ(ギガだま)" : "バケッチャ",
            "パンプジン(こだま)" : "パンプジン",
            "パンプジン(ちゅうだま)" : "パンプジン",
            "パンプジン(おおだま)" : "パンプジン",
            "パンプジン(ギガだま)" : "パンプジン",
        };



//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//きのみのデータ
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
const BERRY_DATA = [
            {no: 1, name: "キーのみ", power: 28},
            {no: 2, name: "ヒメリのみ", power: 27},
            {no: 3, name: "オレンのみ", power: 31},
            {no: 4, name: "ウブのみ", power: 25},
            {no: 5, name: "ドリのみ", power: 30},
            {no: 6, name: "チーゴのみ", power: 32},
            {no: 7, name: "クラボのみ", power: 27},
            {no: 8, name: "カゴのみ", power: 32},
            {no: 9, name: "フィラのみ", power: 29},
            {no: 10, name: "シーヤのみ", power: 24},
            {no: 11, name: "マゴのみ", power: 26},
            {no: 12, name: "ラムのみ", power: 24},
            {no: 13, name: "オボンのみ", power: 30},
            {no: 14, name: "ブリーのみ", power: 26},
            {no: 15, name: "ヤチェのみ", power: 35},
            {no: 16, name: "ウイのみ", power: 31},
            {no: 17, name: "ベリブのみ", power: 33},
            {no: 18, name: "モモンのみ", power: 26}

];

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//ランキングに載せるスキル一覧データ
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
const RANKING_SKILL_ARRAY = [
    "食材セレクトS",
    "プラス(食材ゲットS)",
    "かいりきバサミ(食材セレクトS)",
    "きょううん(食材セレクトS)"
];

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//食材の仮評価データ
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
const FOOD_EVAL_DATA = {
            "おいしいシッポ" : 1500,
            "ずっしりカボチャ" : 900,
            "ふといながねぎ" : 700,
            "あじわいキノコ" : 570,
            "リラックスカカオ" : 570,            
            "つやつやアボカド" : 570,
            "めざましコーヒー" : 520,
            "ピュアなオイル" : 450,
            "ワカクサコーン" : 450,
            "げきからハーブ" : 450,
            "ほっこりポテト" : 450,            
            "とくせんエッグ" : 450
};



//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//食材の並び順を自分で決めるためのデータ
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
const FOOD_DATA = [
            {name: "とくせんリンゴ",        id: 4,  displayOrder: 0},
            {name: "モーモーミルク",        id: 7,  displayOrder: 1},
            {name: "ワカクサ大豆",          id: 14, displayOrder: 2},
            {name: "あまいミツ",            id: 8,  displayOrder: 3},
            {name: "マメミート",            id: 6,  displayOrder: 4},
            {name: "あったかジンジャー",    id: 10, displayOrder: 5},
            {name: "あんみんトマト",        id: 11, displayOrder: 6},
            {name: "とくせんエッグ",        id: 2,  displayOrder: 7},
            {name: "ピュアなオイル",        id: 9,  displayOrder: 8},
            {name: "ほっこりポテト",        id: 3,  displayOrder: 9},
            {name: "げきからハーブ",        id: 5,  displayOrder: 10},
            {name: "リラックスカカオ",      id: 12, displayOrder: 11},
            {name: "あじわいキノコ",        id: 1,  displayOrder: 12},
            {name: "ふといながねぎ",        id: 0,  displayOrder: 13},
            {name: "おいしいシッポ",        id: 13, displayOrder: 14},
            {name: "ワカクサコーン",        id: 15, displayOrder: 15},
            {name: "めざましコーヒー",      id: 16, displayOrder: 16},
            {name: "ずっしりカボチャ",      id: 17, displayOrder: 17},
            {name: "つやつやアボカド",      id: 18, displayOrder: 18}
        ];


const RECIPE_BONUS_DATA = [
        /*Lv1  ～ Lv10 */0.00, 0.02, 0.04, 0.06, 0.08, 0.09, 0.11, 0.13, 0.16, 0.18,
        /*Lv11 ～ Lv20 */0.19, 0.21, 0.23, 0.24, 0.26, 0.28, 0.30, 0.31, 0.33, 0.35,
        /*Lv21 ～ Lv30 */0.37, 0.40, 0.42, 0.45, 0.47, 0.50, 0.52, 0.55, 0.58, 0.61,
        /*Lv31 ～ Lv40 */0.64, 0.67, 0.70, 0.74, 0.77, 0.81, 0.84, 0.88, 0.92, 0.96,
        /*Lv41 ～ Lv50 */1.00, 1.04, 1.08, 1.13, 1.17, 1.22, 1.27, 1.32, 1.37, 1.42,
        /*Lv51 ～ Lv60 */1.48, 1.53, 1.59, 1.65, 1.71, 1.77, 1.83, 1.90, 1.97, 2.03,
        /*Lv61 ～ Lv65 */2.09, 2.15, 2.21, 2.27, 2.34
    ];